app/controllers/admin/analytics_controller.rb

    def index
      @events = Event.order(event_date: :asc)
      @volunteers = Volunteer.order(:full_name)

      assignments = VolunteerAssignment.completed.includes(:volunteer, :event)

      if params[:event_id].present?
        assignments = assignments.where(event_id: params[:event_id])
      end

      if params[:volunteer_id].present?
        assignments = assignments.where(volunteer_id: params[:volunteer_id])
      end

      if params[:date_from].present?
        assignments = assignments.where("date_logged >= ?", params[:date_from])
      end

      if params[:date_to].present?
        assignments = assignments.where("date_logged <= ?", params[:date_to])
      end

      @assignments = assignments

      @volunteer_activity = assignments.group_by(&:volunteer).map do |volunteer, rows|
---
SELECT "events".* FROM "events" ORDER BY "events"."event_date" ASC
SELECT "volunteers".* FROM "volunteers" WHERE 1=1 ORDER BY "volunteers"."full_name" ASC
SELECT "events".* FROM "events" WHERE "events"."id" IN (1, 2)
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" IN (1, 11)
SELECT "events".* FROM "events" WHERE "events"."id" = 1
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" IS NULL LIMIT 1