app/controllers/admin/events_controller.rb

    def index
      @events = Event.order(event_date: :asc, start_time: :asc)
---
SELECT "events".* FROM "events" ORDER BY "events"."event_date" ASC, "events"."start_time" ASC

    def create
      @event = Event.new(event_params)

      if @event.save
---
INSERT INTO "events" ("title", "description", "location", "event_date", "start_time", "end_time", "required_volunteers", "status", "created_at", "updated_at") VALUES ('Catering', 'Food catering', 'EB3', '2026-02-22', '13:00:00', '15:00:00', 1, 'completed', '2026-02-22 21:07:51.122644', '2026-02-22 21:07:51.122644') RETURNING "id"

    def update
      if @event.update(event_params)  # Rails will run all validations, including your custom one
---
UPDATE "events" SET "required_volunteers" = 2, "status" = 'full', "updated_at" = '2026-03-01 02:05:44.194239' WHERE "events"."id" = 1