app/controllers/admin/volunteers_controller.rb

    def index
      @volunteers = Volunteer.order(:full_name)
---
SELECT "volunteers".* FROM "volunteers" ORDER BY "volunteers"."full_name" ASC

    def update
      if @volunteer.update(volunteer_update_params)
---
UPDATE "volunteers" SET "password_digest" = '$2a$12$scZH7j/NMHI2f3Zr/whKiemXsJ01Ap0.OFMa4vE25Ul1S2JlJLRNG', "updated_at" = '2026-02-28 16:09:59.587628' WHERE "volunteers"."id" = 8

    def destroy
      @volunteer.destroy
---
DELETE FROM "volunteers" WHERE "volunteers"."id" = 5

    def set_volunteer
      @volunteer = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = 5 LIMIT 1