app/controllers/admin/volunteer_assignments_controller.rb

    def create
      @assignment = VolunteerAssignment.new(assignment_params)

      if @assignment.save
---
INSERT INTO "volunteer_assignments" ("volunteer_id", "event_id", "status", "hours_worked", "date_logged", "created_at", "updated_at") VALUES (1, 1, 'completed', 2.0, '2026-02-22', '2026-02-22 21:08:07.537197', '2026-02-22 21:08:07.537197') RETURNING "id"

    def set_assignment
      @assignment = VolunteerAssignment.find(params[:id])
---
SELECT "volunteer_assignments".* FROM "volunteer_assignments" WHERE "volunteer_assignments"."id" = 1 LIMIT 1