app/controllers/admin/volunteer_assignments_controller.rb

UPDATE "volunteer_assignments" SET "hours_worked" = 1.0, "updated_at" = '2026-02-26 16:01:39.317047' WHERE "volunteer_assignments"."id" = 1
---
  def approve
    @assignment = VolunteerAssignment.find_by(id: params[:id])
    unless @assignment
      redirect_to admin_volunteer_assignments_path, alert: "Assignment not found." and return
    end

    unless @assignment.volunteer.signed_up_for_event?(@assignment.event)
      redirect_to admin_volunteer_assignments_path, alert: "Volunteer did not sign up for this event." and return
    end

    approved_count = @assignment.event.volunteer_assignments.where(status: 'approved').count
    if approved_count >= @assignment.event.capacity
      redirect_to admin_volunteer_assignments_path, alert: "Cannot approve: Event is already full." and return
    end

    if @assignment.update(status: 'approved')

SELECT "events".* FROM "events" WHERE "events"."id" IN (2, 1)
SELECT "volunteer_assignments".* FROM "volunteer_assignments" ORDER BY "volunteer_assignments"."created_at" DESC
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" IN (2, 1)
---
  def index
    @assignments = VolunteerAssignment.includes(:volunteer, :event).order(created_at: :desc)

INSERT INTO "volunteer_assignments" ("volunteer_id", "event_id", "status", "hours_worked", "date_logged", "created_at", "updated_at") VALUES (11, 1, 'completed', 2.0, '2026-02-28', '2026-03-01 02:06:22.097845', '2026-03-01 02:06:22.097845') RETURNING "id"
---
  def create
    @assignment = VolunteerAssignment.new(assignment_params)

    if @assignment.save

SELECT "volunteer_assignments".* FROM "volunteer_assignments" WHERE "volunteer_assignments"."id" = 1 LIMIT 1
---
  def set_assignment
    @assignment = VolunteerAssignment.find(params[:id])

SELECT "volunteers".* FROM "volunteers" ORDER BY "volunteers"."full_name" ASC
SELECT "events".* FROM "events" ORDER BY "events"."event_date" ASC
---
  def load_options
    @volunteers = Volunteer.order(:full_name)
    @events = Event.order(event_date: :asc)