app/views/admin/volunteer_assignments/_form.html.erb

SELECT "volunteers".* FROM "volunteers" ORDER BY "volunteers"."full_name" ASC
---
  <label>Volunteer</label>
  <%= form.select :volunteer_id,
        options_for_select(@volunteers.map { |v| [v.full_name, v.id] },
        @assignment.volunteer_id),
        include_blank: "Select" %>