app/controllers/admins_controller.rb

UPDATE "admins" SET "email" = 'admin@yeet.com', "updated_at" = '2026-02-27 22:36:54.819646' WHERE "admins"."id" = 1
---
  def update
    @admin = current_user

    if @admin.update(admin_params)