app/controllers/application_controller.rb

  def current_volunteer
    @current_volunteer ||= Volunteer.find_by(id: session[:volunteer_id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" IS NULL LIMIT 1

  def current_admin
    @current_admin ||= Admin.find_by(id: session[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT 1