app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY "events"."event_date" ASC, "events"."start_time" ASC
---
  def index
    @events = Event.order(event_date: :asc, start_time: :asc)