app/controllers/events_controller.rb

  def index
    @events = Event
                .includes(:volunteer_assignments)
                .order(event_date: :asc, start_time: :asc)
---
SELECT "volunteer_assignments".* FROM "volunteer_assignments" WHERE "volunteer_assignments"."event_id" IN (1, 2)