app/controllers/sessions_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."username" = 'code' LIMIT 1
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."username" = 'code' LIMIT 1
---
  def create
    user = Admin.find_by(username: params[:username]) || Volunteer.find_by(username: params[:username])