app/controllers/volunteers_controller.rb

INSERT INTO "volunteers" ("username", "password_digest", "full_name", "email", "phone_number", "address", "skills", "created_at", "updated_at") VALUES ('avkumar2', '$2a$12$KrPRRA5rtQQe3GKmjgdCLud3OePLlc.yLPuWLwoBypnGPbbcutoYi', 'Akhil Kumar', 'avkumar2@ncsu.edu', '7046740758', '1115 Butterburr Dr', '', '2026-02-22 21:04:06.286574', '2026-02-22 21:04:06.286574') RETURNING "id"
---
  def create
    @volunteer = Volunteer.new(volunteer_params)

    if @volunteer.save

UPDATE "volunteers" SET "password_digest" = '$2a$12$2YI7dWCXb.unEItjNguAgesFxwxs65.nZtKXkFeRdJV2jOFXfB2tS', "updated_at" = '2026-02-27 20:05:52.884526' WHERE "volunteers"."id" = 5
---
  def update
    @volunteer = current_volunteer

    if @volunteer.update(volunteer_update_params)

DELETE FROM "volunteers" WHERE "volunteers"."id" = 7
---
  def destroy
    current_volunteer.destroy