app/controllers/volunteer_assignments_controller.rb

  def index
    @assignments = current_user.volunteer_assignments.includes(:event).order(created_at: :desc)
---
SELECT "events".* FROM "events" WHERE "events"."id" IN (2, 1)
SELECT "volunteer_assignments".* FROM "volunteer_assignments" WHERE "volunteer_assignments"."volunteer_id" = 2 ORDER BY "volunteer_assignments"."created_at" DESC

  def history
    @assignments = current_user.volunteer_assignments.completed.includes(:event).order(date_logged: :desc)
---
SELECT "events".* FROM "events" WHERE "events"."id" IN (2, 1)

  def create
    event = Event.find(params[:event_id])

    if current_user.volunteer_assignments.where(event: event).where.not(status: %w[cancelled rejected]).exists?
      redirect_to events_path, alert: "You already signed up for this event."
      return
    end

    unless event.can_accept_volunteers?
      redirect_to events_path, alert: "This event is not accepting volunteers."
      return
    end

    assignment = current_user.volunteer_assignments.build(event: event, status: "pending")

    if assignment.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = 2 LIMIT 1
SELECT 1 AS one FROM "volunteer_assignments" WHERE "volunteer_assignments"."volunteer_id" = 1 AND "volunteer_assignments"."event_id" = 2 AND "volunteer_assignments"."status" NOT IN ('cancelled', 'rejected') LIMIT 1
INSERT INTO "volunteer_assignments" ("volunteer_id", "event_id", "status", "hours_worked", "date_logged", "created_at", "updated_at") VALUES (1, 2, 'pending', NULL, NULL, '2026-02-26 18:33:26.900123', '2026-02-26 18:33:26.900123') RETURNING "id"

  def destroy
    assignment = current_user.volunteer_assignments.find(params[:id])

    if assignment.status == "completed"
      redirect_to volunteer_assignments_path, alert: "Completed assignments cannot be withdrawn."
      return
    end

    assignment.update(status: "cancelled")
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = 2 LIMIT 1
SELECT "volunteer_assignments".* FROM "volunteer_assignments" WHERE "volunteer_assignments"."volunteer_id" = 2 AND "volunteer_assignments"."id" = 3 LIMIT 1
UPDATE "volunteer_assignments" SET "status" = 'cancelled', "updated_at" = '2026-02-26 18:34:17.395128' WHERE "volunteer_assignments"."id" = 3