app/models/volunteer.rb

SELECT COUNT(*) FROM "volunteers"
---
            }

  # Password validations
  validates :password,
            length: { minimum: 6, message: "must be at least 6 characters" },
            confirmation: { message: "does not match" },
            if: -> { password.present? }

SELECT MAX("volunteers"."volunteer_number") FROM "volunteers"
---
  def set_volunteer_number
    last_number = Volunteer.maximum(:volunteer_number) || 0