app/models/volunteer_assignment.rb

  def event_capacity_available
    return unless %w[approved completed].include?(status)
    return if event.blank?

    current_count = event.volunteer_assignments
                         .where(status: %w[approved completed])
                         .where.not(id: id)
                         .count
---
SELECT COUNT(*) FROM "volunteer_assignments" WHERE "volunteer_assignments"."event_id" = 2 AND "volunteer_assignments"."status" IN ('approved', 'completed') AND "volunteer_assignments"."id" IS NOT NULL